In [1]:
import numpy as np
import pandas as pd
import os

In [2]:
os.getcwd()

'C:\\Users\\91965\\Desktop'

In [3]:
os.chdir("C:/Users\91965\Desktop\PANDAS READ DATA\PANDAS READ FILE WITH  DATA")

In [4]:
os.listdir()[3]

'csv_mindex.csv'

In [5]:
# to read json file

a=pd.read_json("employee_data.json")

In [6]:
a

                                              features
0    {'candidate': {'first_name': 'Margaret', 'last...
1    {'candidate': {'first_name': 'Michael', 'last_...
2    {'candidate': {'first_name': 'Brenda', 'last_n...
3    {'candidate': {'first_name': 'Joseph', 'last_n...
4    {'candidate': {'first_name': 'Laura', 'last_na...
..                                                 ...
495  {'candidate': {'first_name': 'Robert', 'last_n...
496  {'candidate': {'first_name': 'Lucas', 'last_na...
497  {'candidate': {'first_name': 'Kimberly', 'last...
498  {'candidate': {'first_name': 'Karla', 'last_na...
499  {'candidate': {'first_name': 'Mrs.', 'last_nam...

[500 rows x 1 columns]

In [7]:
# to convert json file into tabular format:

c=pd.DataFrame([(i["candidate"])for i in a["features"]])

In [8]:
c

,first_name,last_name,skills,state,specialty,experience,relocation
0,Margaret,Mcdonald,"[skLearn, Java, R, SQL, Spark, C++]",AL,Database,Mid,no
1,Michael,Carter,"[TensorFlow, R, Spark, MongoDB, C++, SQL]",AR,Statistics,Senior,yes
2,Brenda,Tyler,[Spark],UT,Database,Mid,no
3,Joseph,King,"[skLearn, SQL, R, Spark, Java, C++, Python, Te...",FL,Machine Learning,Senior,maybe
4,Laura,Webb,"[TensorFlow, C++, SQL, Java, R, MongoDB]",WY,Machine Learning,Junior,maybe
...,...,...,...,...,...,...,...
495,Robert,Baker,"[skLearn, Spark, C++, Java]",WA,Machine Learning,Mid,yes
496,Lucas,Brock,[C++],AR,Machine Learning,Junior,no
497,Kimberly,Richardson,"[Python, Java]",IA,Machine Learning,Junior,maybe
498,Karla,Salazar,"[MongoDB, Python, Java, skLearn]",NE,Data Visualization,Senior,yes
499,Mrs.,Debra,"[skLearn, R, MongoDB, Spark, TensorFlow, Java,...",TX,Statistics,Senior,no

In [9]:
c.shape

(500, 7)

In [9]:
c.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 500 entries, 0 to 499
Data columns (total 7 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   first_name  500 non-null    object
 1   last_name   500 non-null    object
 2   skills      500 non-null    object
 3   state       500 non-null    object
 4   specialty   500 non-null    object
 5   experience  500 non-null    object
 6   relocation  500 non-null    object
dtypes: object(7)
memory usage: 27.5+ KB

In [17]:
c.sort_values("specialty")

,first_name,last_name,skills,state,specialty,experience,relocation
102,Theresa,Martinez,"[Python, SQL, MongoDB, C++, TensorFlow, skLearn]",WI,Data Visualization,Senior,yes
352,Glenn,Stewart,"[TensorFlow, Java, Spark, SQL, R, skLearn, Mon...",NC,Data Visualization,Mid,no
112,Jennifer,Stewart,"[Python, Java, skLearn, R, Spark]",CA,Data Visualization,Senior,maybe
344,Nancy,Morton,"[Spark, Python, SQL, Java, skLearn, MongoDB, T...",MS,Data Visualization,Junior,yes
337,Steven,Allen,"[Java, Spark]",NH,Data Visualization,Junior,no
...,...,...,...,...,...,...,...
353,Theresa,Brown,"[skLearn, C++]",OH,Statistics,Mid,no
354,Alyssa,Sandoval,"[MongoDB, R, skLearn, Python]",OK,Statistics,Junior,no
110,Sarah,Porter,"[MongoDB, Python, skLearn, SQL, Java, TensorFlow]",KY,Statistics,Senior,yes
109,Jacqueline,Spencer,"[Java, Python, skLearn, R, MongoDB, C++, SQL, ...",ME,Statistics,Mid,no
499,Mrs.,Debra,"[skLearn, R, MongoDB, Spark, TensorFlow, Java,...",TX,Statistics,Senior,no

In [30]:
c["specialty"].unique()

array(['Database', 'Statistics', 'Machine Learning', 'Data Visualization'],
      dtype=object)

In [28]:
# total no of employees have specialization in Data Visualization:

c[c["specialty"]=="Data Visualization"].count()

first_name    116
last_name     116
skills        116
state         116
specialty     116
experience    116
relocation    116
dtype: int64

In [29]:
# total no of employees have specialization in Statistics:

c[c["specialty"]=="Statistics"].count()

first_name    133
last_name     133
skills        133
state         133
specialty     133
experience    133
relocation    133
dtype: int64

In [33]:
# total no of employees have specialization in Machin Learning:

c[c["specialty"]=="Machine Learning"].count()

first_name    114
last_name     114
skills        114
state         114
specialty     114
experience    114
relocation    114
dtype: int64

In [32]:
# total no of employees have specialization in Database:

c[c["specialty"]=="Database"].count()

first_name    137
last_name     137
skills        137
state         137
specialty     137
experience    137
relocation    137
dtype: int64

In [10]:
headers=list(pd.DataFrame(a["features"][0]["candidate"]).columns.values)

In [11]:
headers

['first_name',
 'last_name',
 'skills',
 'state',
 'specialty',
 'experience',
 'relocation']

In [12]:

header1=pd.DataFrame(columns=headers)

In [13]:
header1

Empty DataFrame
Columns: [first_name, last_name, skills, state, specialty, experience, relocation]
Index: []

In [14]:
i=0

for i in a["features"]:
    b=pd.DataFrame(i["candidate"])
    header1= pd.concat([header1,b], ignore_index=True)

In [15]:

header1

     first_name last_name      skills state   specialty experience relocation
0      Margaret  Mcdonald     skLearn    AL    Database        Mid         no
1      Margaret  Mcdonald        Java    AL    Database        Mid         no
2      Margaret  Mcdonald           R    AL    Database        Mid         no
3      Margaret  Mcdonald         SQL    AL    Database        Mid         no
4      Margaret  Mcdonald       Spark    AL    Database        Mid         no
...         ...       ...         ...   ...         ...        ...        ...
2463       Mrs.     Debra  TensorFlow    TX  Statistics     Senior         no
2464       Mrs.     Debra        Java    TX  Statistics     Senior         no
2465       Mrs.     Debra         SQL    TX  Statistics     Senior         no
2466       Mrs.     Debra      Python    TX  Statistics     Senior         no
2467       Mrs.     Debra         C++    TX  Statistics     Senior         no

[2468 rows x 7 columns]

In [23]:
header1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2468 entries, 0 to 2467
Data columns (total 7 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   first_name  2468 non-null   object
 1   last_name   2468 non-null   object
 2   skills      2468 non-null   object
 3   state       2468 non-null   object
 4   specialty   2468 non-null   object
 5   experience  2468 non-null   object
 6   relocation  2468 non-null   object
dtypes: object(7)
memory usage: 135.1+ KB

In [35]:
header1["skills"].unique()

array(['skLearn', 'Java', 'R', 'SQL', 'Spark', 'C++', 'TensorFlow',
       'MongoDB', 'Python'], dtype=object)

In [47]:
# Total employees who know Sklearn

header1[header1["skills"]=="skLearn"].count()

first_name    267
last_name     267
skills        267
state         267
specialty     267
experience    267
relocation    267
dtype: int64

In [38]:
# Total employees who know Java

header1[header1["skills"]=="Java"].count()

first_name    267
last_name     267
skills        267
state         267
specialty     267
experience    267
relocation    267
dtype: int64

In [39]:
# Total employees who know R

header1[header1["skills"]=="R"].count()

first_name    272
last_name     272
skills        272
state         272
specialty     272
experience    272
relocation    272
dtype: int64

In [40]:
# Total employees who know SQL

header1[header1["skills"]=="SQL"].count()

first_name    277
last_name     277
skills        277
state         277
specialty     277
experience    277
relocation    277
dtype: int64

In [41]:
# Total employees who know Spark

header1[header1["skills"]=="Spark"].count()

first_name    285
last_name     285
skills        285
state         285
specialty     285
experience    285
relocation    285
dtype: int64

In [42]:
# Total employees who know C++

header1[header1["skills"]=="C++"].count()

first_name    274
last_name     274
skills        274
state         274
specialty     274
experience    274
relocation    274
dtype: int64

In [43]:
# Total employees who know TensorFlow

header1[header1["skills"]=="TensorFlow"].count()

first_name    280
last_name     280
skills        280
state         280
specialty     280
experience    280
relocation    280
dtype: int64

In [44]:
# Total employees who know MongoDB

header1[header1["skills"]=="MongoDB"].count()

first_name    274
last_name     274
skills        274
state         274
specialty     274
experience    274
relocation    274
dtype: int64

In [45]:
# Total employees who know Python

header1[header1["skills"]=="Python"].count()

first_name    272
last_name     272
skills        272
state         272
specialty     272
experience    272
relocation    272
dtype: int64

In [57]:
header1[header1["skills"]=="Python"].shape[0]

272

In [16]:
# List of Employees having knowledge of "R" and  specialization in "Database"

header1[(header1.skills=="R") & (header1.specialty=="Database")]

     first_name last_name skills state specialty experience relocation
2      Margaret  Mcdonald      R    AL  Database        Mid         no
142       Norma    Norris      R    HI  Database     Junior        yes
158       Donna      Cole      R    CO  Database     Junior      maybe
260     Tiffany    Ramsey      R    SC  Database     Senior      maybe
294        Paul    Miller      R    LA  Database        Mid         no
...         ...       ...    ...   ...       ...        ...        ...
2310     Steven   Nichols      R    WV  Database        Mid      maybe
2313       John    Walker      R    MN  Database     Senior        yes
2319      James    Steele      R    MN  Database     Junior        yes
2418       Jill    Harmon      R    NH  Database        Mid         no
2437   Jennifer    Harris      R    AL  Database     Senior        yes

[63 rows x 7 columns]

In [50]:
# Total employees having knowledge of "R" and "Database"

header1[(header1.skills=="R") & (header1.specialty=="Database")].shape[0]

63

In [51]:
header1[(header1.skills=="R") & (header1.specialty=="Database")].count()

first_name    63
last_name     63
skills        63
state         63
specialty     63
experience    63
relocation    63
dtype: int64

In [22]:
# List of employess having knowledge of R/SQL/Jave and specialzed in Staticstics and are in state AR


header1[(header1.skills.isin(['R','SQL','Java'])) & (header1.specialty == 'Statistics') & (header1.state == 'AR')]

     first_name last_name skills state   specialty experience relocation
7       Michael    Carter      R    AR  Statistics     Senior        yes
11      Michael    Carter    SQL    AR  Statistics     Senior        yes
103       James    Mosley      R    AR  Statistics     Junior        yes
104       James    Mosley   Java    AR  Statistics     Junior        yes
1957     Sandra   Blevins      R    AR  Statistics        Mid      maybe

In [52]:
# Total no of emplyees who have knowledge of R/SQL/Java and specialized in Statistics and staying in state "AR"

header1[(header1.skills.isin(['R','SQL','Java'])) & (header1.specialty == 'Statistics') & (header1.state == 'AR')].shape[0]

5

In [23]:
# List of employees who are having skills SQL/C++/Python and specialsed either in Data Visualization ot Statistics:

header1[(header1.skills.isin(["SQL","C++","Python"])) & (header1.specialty.isin(["Data Visualization", "Statistics"]))]

,first_name,last_name,skills,state,specialty,experience,relocation
10,Michael,Carter,C++,AR,Statistics,Senior,yes
11,Michael,Carter,SQL,AR,Statistics,Senior,yes
27,Cheryl,Ramirez,C++,OK,Data Visualization,Mid,no
28,Cheryl,Ramirez,Python,OK,Data Visualization,Mid,no
32,Cheryl,Ramirez,SQL,OK,Data Visualization,Mid,no
...,...,...,...,...,...,...,...
2442,Ms.,Tracy,Python,NM,Data Visualization,Mid,maybe
2456,Karla,Salazar,Python,NE,Data Visualization,Senior,yes
2465,Mrs.,Debra,SQL,TX,Statistics,Senior,no
2466,Mrs.,Debra,Python,TX,Statistics,Senior,no
2467,Mrs.,Debra,C++,TX,Statistics,Senior,no

In [55]:
#Total employees who are having skills SQL/C++/Python and specialsed either in Data Visualization ot Statistics:

header1[(header1.skills.isin(["SQL","C++","Python"])) & (header1.specialty.isin(["Data Visualization", "Statistics"]))].shape[0]

413

In [25]:
#List of employees who are having skills C++ Or Python and specialsed in Machine Learning:

header1[(header1.skills.isin(["C++", "Python"]))&(header1.specialty=="Machine Learning")]

,first_name,last_name,skills,state,specialty,experience,relocation
18,Joseph,King,C++,FL,Machine Learning,Senior,maybe
19,Joseph,King,Python,FL,Machine Learning,Senior,maybe
22,Laura,Webb,C++,WY,Machine Learning,Junior,maybe
37,Charles,Stewart,C++,NM,Machine Learning,Mid,maybe
41,Charles,Stewart,Python,NM,Machine Learning,Mid,maybe
...,...,...,...,...,...,...,...
2429,Mark,Mcknight,C++,AK,Machine Learning,Senior,yes
2446,Brandon,Moore,C++,MO,Machine Learning,Mid,no
2450,Robert,Baker,C++,WA,Machine Learning,Mid,yes
2452,Lucas,Brock,C++,AR,Machine Learning,Junior,no
2453,Kimberly,Richardson,Python,IA,Machine Learning,Junior,maybe

In [56]:
#Total employees who are having skills C++ OR Python and specialsed Machine Learning:

header1[(header1.skills.isin(["C++", "Python"]))&(header1.specialty=="Machine Learning")] .shape[0]

136

In [ ]:
# List of emplyees who are having knwledge of both "R and SQL":

In [58]:
candidatelist=pd.DataFrame(columns=headers)
lst=[]

for i in range(len(c["skills"])):
    if "R" in c["skills"][i] and "SQL" in c["skills"][i]:
        lst.append(a["features"][i]["candidate"])

candidatelist=pd.DataFrame(lst)
            
print("Shortlisted candidates are as follow:\n")

candidatelist

Shortlisted candidates are as follow:

,first_name,last_name,skills,state,specialty,experience,relocation
0,Margaret,Mcdonald,"[skLearn, Java, R, SQL, Spark, C++]",AL,Database,Mid,no
1,Michael,Carter,"[TensorFlow, R, Spark, MongoDB, C++, SQL]",AR,Statistics,Senior,yes
2,Joseph,King,"[skLearn, SQL, R, Spark, Java, C++, Python, Te...",FL,Machine Learning,Senior,maybe
3,Laura,Webb,"[TensorFlow, C++, SQL, Java, R, MongoDB]",WY,Machine Learning,Junior,maybe
4,Cheryl,Ramirez,"[C++, Python, R, Java, skLearn, SQL, MongoDB, ...",OK,Data Visualization,Mid,no
...,...,...,...,...,...,...,...
177,Philip,Walters,"[SQL, C++, Spark, Python, R, MongoDB, Java, Te...",NE,Machine Learning,Junior,maybe
178,Jill,Harmon,"[skLearn, Java, R, Python, SQL, Spark, C++]",NH,Database,Mid,no
179,Mark,Mcknight,"[R, Spark, SQL, TensorFlow, Python, MongoDB, C...",AK,Machine Learning,Senior,yes
180,Jennifer,Harris,"[SQL, C++, Java, Spark, Python, R, TensorFlow,...",AL,Database,Senior,yes
181,Mrs.,Debra,"[skLearn, R, MongoDB, Spark, TensorFlow, Java,...",TX,Statistics,Senior,no

In [62]:
# Total no of emplyees who are having knwledge of both "R and SQL":

candidatelist.shape[0]

182

In [ ]:
# list of candidates who have the knowledge of "Spark, Java and TensorFlow" and specialization in "Statistics"
 and having "Mid" experience

In [64]:
candidatelist1=pd.DataFrame(columns=headers)
lst=[]

for i in range(len(c["skills"])):
    if "Spark" in c["skills"][i] and "Java" in c["skills"][i] and "TensorFlow" in c["skills"][i] and "Statistics" in c["specialty"][i] and "Mid" in c["experience"][i]:
        lst.append(a["features"][i]["candidate"])

candidatelist1=pd.DataFrame(lst)
            
print("Shortlisted candidates are as follow:\n")

candidatelist1

Shortlisted candidates are as follow:

,first_name,last_name,skills,state,specialty,experience,relocation
0,Amber,Gibbs,"[MongoDB, Java, TensorFlow, Spark]",NM,Statistics,Mid,no
1,Richard,Estrada,"[Java, TensorFlow, skLearn, R, C++, Python, Sp...",TX,Statistics,Mid,maybe
2,Neil,Maxwell,"[Python, Spark, R, TensorFlow, SQL, Java, C++]",DE,Statistics,Mid,yes
3,Norma,Foley,"[MongoDB, SQL, Spark, R, skLearn, Python, Java...",MN,Statistics,Mid,maybe
4,Deborah,Moss,"[Java, SQL, R, C++, skLearn, MongoDB, Python, ...",UT,Statistics,Mid,yes
5,Vicki,Ellison,"[R, Spark, TensorFlow, Java, skLearn]",MI,Statistics,Mid,no
6,Paula,Curtis,"[SQL, Python, TensorFlow, Spark, skLearn, C++,...",ND,Statistics,Mid,no
7,Timothy,Perez,"[skLearn, Python, TensorFlow, R, Spark, MongoD...",IL,Statistics,Mid,maybe
8,Jared,Griffith,"[skLearn, MongoDB, C++, SQL, Java, TensorFlow,...",IN,Statistics,Mid,maybe
9,Miranda,Mitchell,"[C++, R, Java, Python, SQL, Spark, MongoDB, sk...",WY,Statistics,Mid,maybe
10,Joann,Jones,"[Spark, C++, SQL, TensorFlow, MongoDB, Java, s...",FL,Statistics,Mid,yes
11,Ashley,Chung,"[SQL, Spark, Java, C++, TensorFlow, Python, R,...",NJ,Statistics,Mid,no
12,Janet,Cunningham,"[Java, skLearn, TensorFlow, Python, Spark, Mon...",DE,Statistics,Mid,yes
13,Lisa,Conley,"[R, Python, skLearn, SQL, MongoDB, Spark, Tens...",DE,Statistics,Mid,maybe

In [65]:
#Total no. of candidates who have the knowledge of "Spark, Java and TensorFlow" and having specialization in "Statistics" and 
# having "Mid" experience

candidatelist1.shape[0]

14

In [68]:
c

,first_name,last_name,skills,state,specialty,experience,relocation
0,Margaret,Mcdonald,"[skLearn, Java, R, SQL, Spark, C++]",AL,Database,Mid,no
1,Michael,Carter,"[TensorFlow, R, Spark, MongoDB, C++, SQL]",AR,Statistics,Senior,yes
2,Brenda,Tyler,[Spark],UT,Database,Mid,no
3,Joseph,King,"[skLearn, SQL, R, Spark, Java, C++, Python, Te...",FL,Machine Learning,Senior,maybe
4,Laura,Webb,"[TensorFlow, C++, SQL, Java, R, MongoDB]",WY,Machine Learning,Junior,maybe
...,...,...,...,...,...,...,...
495,Robert,Baker,"[skLearn, Spark, C++, Java]",WA,Machine Learning,Mid,yes
496,Lucas,Brock,[C++],AR,Machine Learning,Junior,no
497,Kimberly,Richardson,"[Python, Java]",IA,Machine Learning,Junior,maybe
498,Karla,Salazar,"[MongoDB, Python, Java, skLearn]",NE,Data Visualization,Senior,yes
499,Mrs.,Debra,"[skLearn, R, MongoDB, Spark, TensorFlow, Java,...",TX,Statistics,Senior,no

In [69]:
c.sort_values("state")

,first_name,last_name,skills,state,specialty,experience,relocation
37,Christine,Walker,"[Python, C++, TensorFlow, Java, Spark, skLearn...",AK,Machine Learning,Mid,maybe
406,Brittany,Nelson,"[Java, TensorFlow, skLearn, MongoDB, Spark, SQ...",AK,Statistics,Senior,yes
302,Katherine,Bradshaw,"[Java, R, skLearn, C++, MongoDB, Python]",AK,Statistics,Mid,maybe
186,Deanna,Diaz,"[TensorFlow, skLearn, R, C++, SQL, Spark, Python]",AK,Machine Learning,Mid,no
329,Katherine,Christian,"[Spark, C++]",AK,Statistics,Senior,no
...,...,...,...,...,...,...,...
473,Haley,Reed,"[R, SQL, Java, skLearn, Python]",WY,Statistics,Junior,no
305,Travis,Willis,"[SQL, MongoDB, Java, Python, skLearn]",WY,Database,Mid,no
301,Miranda,Mitchell,"[C++, R, Java, Python, SQL, Spark, MongoDB, sk...",WY,Statistics,Mid,maybe
232,Peter,Torres,"[R, MongoDB, SQL, TensorFlow, Java, Spark, skL...",WY,Machine Learning,Mid,yes
336,Dominic,Rivera,"[Python, skLearn, MongoDB, C++, SQL, TensorFlo...",WY,Machine Learning,Junior,no

In [73]:
c["state"].unique()

array(['AL', 'AR', 'UT', 'FL', 'WY', 'OK', 'NM', 'TX', 'WI', 'PA', 'NV',
       'MO', 'ID', 'KY', 'NE', 'WV', 'NC', 'TN', 'CT', 'IN', 'ND', 'HI',
       'NJ', 'GA', 'CO', 'LA', 'AK', 'SD', 'MA', 'MT', 'SC', 'NY', 'DE',
       'IL', 'AZ', 'IA', 'WA', 'VA', 'RI', 'MD', 'CA', 'OR', 'ME', 'OH',
       'KS', 'MN', 'MI', 'MS', 'NH', 'VT'], dtype=object)

In [74]:
# total candidates staying at "WY":

c[c["state"]=="WY"].shape[0]

11

In [76]:
c[c["state"]=="MN"].shape[0]

13

In [77]:
c[c["state"]=="AK"].shape[0]

10

In [78]:
c["experience"].unique()

array(['Mid', 'Senior', 'Junior'], dtype=object)

In [80]:
#total candidates having "Mid" experience:

c[c["experience"]=="Mid"].shape[0]

179

In [81]:
c[c["experience"]=="Senior"].shape[0]

163

In [82]:
c[c["experience"]=="Junior"].shape[0]

158